**Terragrunt apply** [`success`]

## Apply result

Show apply for the following directories:

<details><summary>live/dev/bar/network</summary>


<pre>
14:13:32.706 INFO   Terragrunt Cache server is listening on 127.0.0.1:37941
14:13:32.707 INFO   Start Terragrunt Cache server
The stack at live/dev/bar/network will be processed in the following order for command apply:
Group 1
- Module ./vpc


[vpc] : Terraform used the selected providers to generate the following execution
[vpc] : plan. Resource actions are indicated with the following symbols:
[vpc] :   + create
[vpc] : Terraform will perform the following actions:
[vpc] :   # aws_cloudwatch_log_group.this[0] will be created
[vpc] :   + resource "aws_cloudwatch_log_group" "this" {
[vpc] :       + arn               = (known after apply)
[vpc] :       + id                = (known after apply)
[vpc] :       + log_group_class   = (known after apply)
[vpc] :       + name              = (known after apply)
[vpc] :       + name_prefix       = (known after apply)
[vpc] :       + retention_in_days = 14
[vpc] :       + skip_destroy      = false
[vpc] :       + tags              = {
[vpc] :           + "application_name" = "bar"
[vpc] :           + "contact_email"    = "bar-team@example.com"
[vpc] :           + "environment"      = "development"
[vpc] :           + "managed_by"       = "terraform"
[vpc] :           + "name"             = "cloudwatch-log-group-bar-app-dev"
[vpc] :           + "team_owner"       = "bar-team"
[vpc] :         }
[vpc] :       + tags_all          = {
[vpc] :           + "application_name" = "bar"
[vpc] :           + "contact_email"    = "bar-team@example.com"
[vpc] :           + "environment"      = "development"
[vpc] :           + "managed_by"       = "terraform"
[vpc] :           + "name"             = "cloudwatch-log-group-bar-app-dev"
[vpc] :           + "team_owner"       = "bar-team"
[vpc] :         }
[vpc] :     }
[vpc] :   # aws_eip.this will be created
[vpc] :   + resource "aws_eip" "this" {
[vpc] :       + allocation_id             = (known after apply)
[vpc] :       + arn                       = (known after apply)
[vpc] :       + associate_with_private_ip = "192.169.1.10"
[vpc] :       + association_id            = (known after apply)
[vpc] :       + carrier_ip                = (known after apply)
[vpc] :       + customer_owned_ip         = (known after apply)
[vpc] :       + domain                    = (known after apply)
[vpc] :       + id                        = (known after apply)
[vpc] :       + instance                  = (known after apply)
[vpc] :       + ipam_pool_id              = (known after apply)
[vpc] :       + network_border_group      = (known after apply)
[vpc] :       + network_interface         = (known after apply)
[vpc] :       + private_dns               = (known after apply)
[vpc] :       + private_ip                = (known after apply)
[vpc] :       + ptr_record                = (known after apply)
[vpc] :       + public_dns                = (known after apply)
[vpc] :       + public_ip                 = (known after apply)
[vpc] :       + public_ipv4_pool          = (known after apply)
[vpc] :       + tags                      = {
[vpc] :           + "application_name" = "bar"
[vpc] :           + "contact_email"    = "bar-team@example.com"
[vpc] :           + "environment"      = "development"
[vpc] :           + "managed_by"       = "terraform"
[vpc] :           + "name"             = "eip-bar-app-dev"
[vpc] :           + "team_owner"       = "bar-team"
[vpc] :         }
[vpc] :       + tags_all                  = {
[vpc] :           + "application_name" = "bar"
[vpc] :           + "contact_email"    = "bar-team@example.com"
[vpc] :           + "environment"      = "development"
[vpc] :           + "managed_by"       = "terraform"
[vpc] :           + "name"             = "eip-bar-app-dev"
[vpc] :           + "team_owner"       = "bar-team"
[vpc] :         }
[vpc] :       + vpc                       = (known after apply)
[vpc] :     }
[vpc] :   # aws_flow_log.this[0] will be created
[vpc] :   + resource "aws_flow_log" "this" {
[vpc] :       + arn                      = (known after apply)
[vpc] :       + iam_role_arn             = (known after apply)
[vpc] :       + id                       = (known after apply)
[vpc] :       + log_destination          = (known after apply)
[vpc] :       + log_destination_type     = "cloud-watch-logs"
[vpc] :       + log_format               = (known after apply)
[vpc] :       + log_group_name           = (known after apply)
[vpc] :       + max_aggregation_interval = 600
[vpc] :       + tags                     = {
[vpc] :           + "application_name" = "bar"
[vpc] :           + "contact_email"    = "bar-team@example.com"
[vpc] :           + "environment"      = "development"
[vpc] :           + "managed_by"       = "terraform"
[vpc] :           + "name"             = "flow-log-bar-app-dev"
[vpc] :           + "team_owner"       = "bar-team"
[vpc] :         }
[vpc] :       + tags_all                 = {
[vpc] :           + "application_name" = "bar"
[vpc] :           + "contact_email"    = "bar-team@example.com"
[vpc] :           + "environment"      = "development"
[vpc] :           + "managed_by"       = "terraform"
[vpc] :           + "name"             = "flow-log-bar-app-dev"
[vpc] :           + "team_owner"       = "bar-team"
[vpc] :         }
[vpc] :       + traffic_type             = "ALL"
[vpc] :       + vpc_id                   = (known after apply)
[vpc] :     }
[vpc] :   # aws_iam_policy.this[0] will be created
[vpc] :   + resource "aws_iam_policy" "this" {
[vpc] :       + arn              = (known after apply)
[vpc] :       + attachment_count = (known after apply)
[vpc] :       + id               = (known after apply)
[vpc] :       + name             = "flow-log-policy-bar-app-dev"
[vpc] :       + name_prefix      = (known after apply)
[vpc] :       + path             = "/"
[vpc] :       + policy           = jsonencode(
[vpc] :             {
[vpc] :               + Statement = [
[vpc] :                   + {
[vpc] :                       + Action   = [
[vpc] :                           + "logs:CreateLogGroup",
[vpc] :                           + "logs:CreateLogStream",
[vpc] :                           + "logs:PutLogEvents",
[vpc] :                           + "logs:DescribeLogGroups",
[vpc] :                           + "logs:DescribeLogStreams",
[vpc] :                         ]
[vpc] :                       + Effect   = "Allow"
[vpc] :                       + Resource = "*"
[vpc] :                     },
[vpc] :                 ]
[vpc] :               + Version   = "2012-10-17"
[vpc] :             }
[vpc] :         )
[vpc] :       + policy_id        = (known after apply)
[vpc] :       + tags             = {
[vpc] :           + "application_name" = "bar"
[vpc] :           + "contact_email"    = "bar-team@example.com"
[vpc] :           + "environment"      = "development"
[vpc] :           + "managed_by"       = "terraform"
[vpc] :           + "team_owner"       = "bar-team"
[vpc] :         }
[vpc] :       + tags_all         = {
[vpc] :           + "application_name" = "bar"
[vpc] :           + "contact_email"    = "bar-team@example.com"
[vpc] :           + "environment"      = "development"
[vpc] :           + "managed_by"       = "terraform"
[vpc] :           + "team_owner"       = "bar-team"
[vpc] :         }
[vpc] :     }
[vpc] :   # aws_iam_role.this[0] will be created
[vpc] :   + resource "aws_iam_role" "this" {
[vpc] :       + arn                   = (known after apply)
[vpc] :       + assume_role_policy    = jsonencode(
[vpc] :             {
[vpc] :               + Statement = [
[vpc] :                   + {
[vpc] :                       + Action    = "sts:AssumeRole"
[vpc] :                       + Effect    = "Allow"
[vpc] :                       + Principal = {
[vpc] :                           + Service = "vpc-flow-logs.amazonaws.com"
[vpc] :                         }
[vpc] :                     },
[vpc] :                 ]
[vpc] :               + Version   = "2012-10-17"
[vpc] :             }
[vpc] :         )
[vpc] :       + create_date           = (known after apply)
[vpc] :       + force_detach_policies = false
[vpc] :       + id                    = (known after apply)
[vpc] :       + managed_policy_arns   = (known after apply)
[vpc] :       + max_session_duration  = 3600
[vpc] :       + name                  = "flow-log-role-bar-app-dev"
[vpc] :       + name_prefix           = (known after apply)
[vpc] :       + path                  = "/"
[vpc] :       + tags                  = {
[vpc] :           + "application_name" = "bar"
[vpc] :           + "contact_email"    = "bar-team@example.com"
[vpc] :           + "environment"      = "development"
[vpc] :           + "managed_by"       = "terraform"
[vpc] :           + "team_owner"       = "bar-team"
[vpc] :         }
[vpc] :       + tags_all              = {
[vpc] :           + "application_name" = "bar"
[vpc] :           + "contact_email"    = "bar-team@example.com"
[vpc] :           + "environment"      = "development"
[vpc] :           + "managed_by"       = "terraform"
[vpc] :           + "team_owner"       = "bar-team"
[vpc] :         }
[vpc] :       + unique_id             = (known after apply)
[vpc] :       + inline_policy (known after apply)
[vpc] :     }
[vpc] :   # aws_iam_role_policy_attachment.this[0] will be created
[vpc] :   + resource "aws_iam_role_policy_attachment" "this" {
[vpc] :       + id         = (known after apply)
[vpc] :       + policy_arn = (known after apply)
[vpc] :       + role       = (known after apply)
[vpc] :     }
[vpc] :   # aws_internet_gateway.this will be created
[vpc] :   + resource "aws_internet_gateway" "this" {
[vpc] :       + arn      = (known after apply)
[vpc] :       + id       = (known after apply)
[vpc] :       + owner_id = (known after apply)
[vpc] :       + tags     = {
[vpc] :           + "application_name" = "bar"
[vpc] :           + "contact_email"    = "bar-team@example.com"
[vpc] :           + "environment"      = "development"
[vpc] :           + "managed_by"       = "terraform"
[vpc] :           + "name"             = "igw-bar-app-dev"
[vpc] :           + "team_owner"       = "bar-team"
[vpc] :         }
[vpc] :       + tags_all = {
[vpc] :           + "application_name" = "bar"
[vpc] :           + "contact_email"    = "bar-team@example.com"
[vpc] :           + "environment"      = "development"
[vpc] :           + "managed_by"       = "terraform"
[vpc] :           + "name"             = "igw-bar-app-dev"
[vpc] :           + "team_owner"       = "bar-team"
[vpc] :         }
[vpc] :       + vpc_id   = (known after apply)
[vpc] :     }
[vpc] :   # aws_nat_gateway.this will be created
[vpc] :   + resource "aws_nat_gateway" "this" {
[vpc] :       + allocation_id                      = (known after apply)
[vpc] :       + association_id                     = (known after apply)
[vpc] :       + connectivity_type                  = "public"
[vpc] :       + id                                 = (known after apply)
[vpc] :       + network_interface_id               = (known after apply)
[vpc] :       + private_ip                         = (known after apply)
[vpc] :       + public_ip                          = (known after apply)
[vpc] :       + secondary_private_ip_address_count = (known after apply)
[vpc] :       + secondary_private_ip_addresses     = (known after apply)
[vpc] :       + subnet_id                          = (known after apply)
[vpc] :       + tags                               = {
[vpc] :           + "application_name" = "bar"
[vpc] :           + "contact_email"    = "bar-team@example.com"
[vpc] :           + "environment"      = "development"
[vpc] :           + "managed_by"       = "terraform"
[vpc] :           + "name"             = "nat-gateway-bar-app-dev"
[vpc] :           + "team_owner"       = "bar-team"
[vpc] :         }
[vpc] :       + tags_all                           = {
[vpc] :           + "application_name" = "bar"
[vpc] :           + "contact_email"    = "bar-team@example.com"
[vpc] :           + "environment"      = "development"
[vpc] :           + "managed_by"       = "terraform"
[vpc] :           + "name"             = "nat-gateway-bar-app-dev"
[vpc] :           + "team_owner"       = "bar-team"
[vpc] :         }
[vpc] :     }
[vpc] :   # aws_route_table.private will be created
[vpc] :   + resource "aws_route_table" "private" {
[vpc] :       + arn              = (known after apply)
[vpc] :       + id               = (known after apply)
[vpc] :       + owner_id         = (known after apply)
[vpc] :       + propagating_vgws = (known after apply)
[vpc] :       + route            = [
[vpc] :           + {
[vpc] :               + cidr_block                 = "0.0.0.0/0"
[vpc] :               + nat_gateway_id             = (known after apply)
[vpc] :                 # (11 unchanged attributes hidden)
[vpc] :             },
[vpc] :         ]
[vpc] :       + tags             = {
[vpc] :           + "application_name" = "bar"
[vpc] :           + "contact_email"    = "bar-team@example.com"
[vpc] :           + "environment"      = "development"
[vpc] :           + "managed_by"       = "terraform"
[vpc] :           + "name"             = "private-route-table-bar-app-dev"
[vpc] :           + "team_owner"       = "bar-team"
[vpc] :         }
[vpc] :       + tags_all         = {
[vpc] :           + "application_name" = "bar"
[vpc] :           + "contact_email"    = "bar-team@example.com"
[vpc] :           + "environment"      = "development"
[vpc] :           + "managed_by"       = "terraform"
[vpc] :           + "name"             = "private-route-table-bar-app-dev"
[vpc] :           + "team_owner"       = "bar-team"
[vpc] :         }
[vpc] :       + vpc_id           = (known after apply)
[vpc] :     }
[vpc] :   # aws_route_table.public will be created
[vpc] :   + resource "aws_route_table" "public" {
[vpc] :       + arn              = (known after apply)
[vpc] :       + id               = (known after apply)
[vpc] :       + owner_id         = (known after apply)
[vpc] :       + propagating_vgws = (known after apply)
[vpc] :       + route            = [
[vpc] :           + {
[vpc] :               + cidr_block                 = "0.0.0.0/0"
[vpc] :               + gateway_id                 = (known after apply)
[vpc] :                 # (11 unchanged attributes hidden)
[vpc] :             },
[vpc] :         ]
[vpc] :       + tags             = {
[vpc] :           + "application_name" = "bar"
[vpc] :           + "contact_email"    = "bar-team@example.com"
[vpc] :           + "environment"      = "development"
[vpc] :           + "managed_by"       = "terraform"
[vpc] :           + "name"             = "public-route-table-bar-app-dev"
[vpc] :           + "team_owner"       = "bar-team"
[vpc] :         }
[vpc] :       + tags_all         = {
[vpc] :           + "application_name" = "bar"
[vpc] :           + "contact_email"    = "bar-team@example.com"
[vpc] :           + "environment"      = "development"
[vpc] :           + "managed_by"       = "terraform"
[vpc] :           + "name"             = "public-route-table-bar-app-dev"
[vpc] :           + "team_owner"       = "bar-team"
[vpc] :         }
[vpc] :       + vpc_id           = (known after apply)
[vpc] :     }
[vpc] :   # aws_route_table_association.private["private-subnet-1"] will be created
[vpc] :   + resource "aws_route_table_association" "private" {
[vpc] :       + id             = (known after apply)
[vpc] :       + route_table_id = (known after apply)
[vpc] :       + subnet_id      = (known after apply)
[vpc] :     }
[vpc] :   # aws_route_table_association.private["private-subnet-2"] will be created
[vpc] :   + resource "aws_route_table_association" "private" {
[vpc] :       + id             = (known after apply)
[vpc] :       + route_table_id = (known after apply)
[vpc] :       + subnet_id      = (known after apply)
[vpc] :     }
[vpc] :   # aws_route_table_association.public["public-subnet-1"] will be created
[vpc] :   + resource "aws_route_table_association" "public" {
[vpc] :       + id             = (known after apply)
[vpc] :       + route_table_id = (known after apply)
[vpc] :       + subnet_id      = (known after apply)
[vpc] :     }
[vpc] :   # aws_subnet.private["private-subnet-1"] will be created
[vpc] :   + resource "aws_subnet" "private" {
[vpc] :       + arn                                            = (known after apply)
[vpc] :       + assign_ipv6_address_on_creation                = false
[vpc] :       + availability_zone                              = "us-west-1a"
[vpc] :       + availability_zone_id                           = (known after apply)
[vpc] :       + cidr_block                                     = "192.169.2.0/24"
[vpc] :       + enable_dns64                                   = false
[vpc] :       + enable_resource_name_dns_a_record_on_launch    = false
[vpc] :       + enable_resource_name_dns_aaaa_record_on_launch = false
[vpc] :       + id                                             = (known after apply)
[vpc] :       + ipv6_cidr_block_association_id                 = (known after apply)
[vpc] :       + ipv6_native                                    = false
[vpc] :       + map_public_ip_on_launch                        = false
[vpc] :       + owner_id                                       = (known after apply)
[vpc] :       + private_dns_hostname_type_on_launch            = (known after apply)
[vpc] :       + tags                                           = {
[vpc] :           + "application_name" = "bar"
[vpc] :           + "contact_email"    = "bar-team@example.com"
[vpc] :           + "environment"      = "development"
[vpc] :           + "managed_by"       = "terraform"
[vpc] :           + "name"             = "private-subnet-bar-app-dev-1a"
[vpc] :           + "team_owner"       = "bar-team"
[vpc] :         }
[vpc] :       + tags_all                                       = {
[vpc] :           + "application_name" = "bar"
[vpc] :           + "contact_email"    = "bar-team@example.com"
[vpc] :           + "environment"      = "development"
[vpc] :           + "managed_by"       = "terraform"
[vpc] :           + "name"             = "private-subnet-bar-app-dev-1a"
[vpc] :           + "team_owner"       = "bar-team"
[vpc] :         }
[vpc] :       + vpc_id                                         = (known after apply)
[vpc] :     }
[vpc] :   # aws_subnet.private["private-subnet-2"] will be created
[vpc] :   + resource "aws_subnet" "private" {
[vpc] :       + arn                                            = (known after apply)
[vpc] :       + assign_ipv6_address_on_creation                = false
[vpc] :       + availability_zone                              = "us-west-1b"
[vpc] :       + availability_zone_id                           = (known after apply)
[vpc] :       + cidr_block                                     = "192.169.3.0/24"
[vpc] :       + enable_dns64                                   = false
[vpc] :       + enable_resource_name_dns_a_record_on_launch    = false
[vpc] :       + enable_resource_name_dns_aaaa_record_on_launch = false
[vpc] :       + id                                             = (known after apply)
[vpc] :       + ipv6_cidr_block_association_id                 = (known after apply)
[vpc] :       + ipv6_native                                    = false
[vpc] :       + map_public_ip_on_launch                        = false
[vpc] :       + owner_id                                       = (known after apply)
[vpc] :       + private_dns_hostname_type_on_launch            = (known after apply)
[vpc] :       + tags                                           = {
[vpc] :           + "application_name" = "bar"
[vpc] :           + "contact_email"    = "bar-team@example.com"
[vpc] :           + "environment"      = "development"
[vpc] :           + "managed_by"       = "terraform"
[vpc] :           + "name"             = "private-subnet-bar-app-dev-1c"
[vpc] :           + "team_owner"       = "bar-team"
[vpc] :         }
[vpc] :       + tags_all                                       = {
[vpc] :           + "application_name" = "bar"
[vpc] :           + "contact_email"    = "bar-team@example.com"
[vpc] :           + "environment"      = "development"
[vpc] :           + "managed_by"       = "terraform"
[vpc] :           + "name"             = "private-subnet-bar-app-dev-1c"
[vpc] :           + "team_owner"       = "bar-team"
[vpc] :         }
[vpc] :       + vpc_id                                         = (known after apply)
[vpc] :     }
[vpc] :   # aws_subnet.public["public-subnet-1"] will be created
[vpc] :   + resource "aws_subnet" "public" {
[vpc] :       + arn                                            = (known after apply)
[vpc] :       + assign_ipv6_address_on_creation                = false
[vpc] :       + availability_zone                              = "us-west-1a"
[vpc] :       + availability_zone_id                           = (known after apply)
[vpc] :       + cidr_block                                     = "192.169.1.0/24"
[vpc] :       + enable_dns64                                   = false
[vpc] :       + enable_resource_name_dns_a_record_on_launch    = false
[vpc] :       + enable_resource_name_dns_aaaa_record_on_launch = false
[vpc] :       + id                                             = (known after apply)
[vpc] :       + ipv6_cidr_block_association_id                 = (known after apply)
[vpc] :       + ipv6_native                                    = false
[vpc] :       + map_public_ip_on_launch                        = true
[vpc] :       + owner_id                                       = (known after apply)
[vpc] :       + private_dns_hostname_type_on_launch            = (known after apply)
[vpc] :       + tags                                           = {
[vpc] :           + "application_name" = "bar"
[vpc] :           + "contact_email"    = "bar-team@example.com"
[vpc] :           + "environment"      = "development"
[vpc] :           + "managed_by"       = "terraform"
[vpc] :           + "name"             = "public-subnet-bar-app-dev-1a"
[vpc] :           + "team_owner"       = "bar-team"
[vpc] :         }
[vpc] :       + tags_all                                       = {
[vpc] :           + "application_name" = "bar"
[vpc] :           + "contact_email"    = "bar-team@example.com"
[vpc] :           + "environment"      = "development"
[vpc] :           + "managed_by"       = "terraform"
[vpc] :           + "name"             = "public-subnet-bar-app-dev-1a"
[vpc] :           + "team_owner"       = "bar-team"
[vpc] :         }
[vpc] :       + vpc_id                                         = (known after apply)
[vpc] :     }
[vpc] :   # aws_vpc.this will be created
[vpc] :   + resource "aws_vpc" "this" {
[vpc] :       + arn                                  = (known after apply)
[vpc] :       + cidr_block                           = "192.169.0.0/16"
[vpc] :       + default_network_acl_id               = (known after apply)
[vpc] :       + default_route_table_id               = (known after apply)
[vpc] :       + default_security_group_id            = (known after apply)
[vpc] :       + dhcp_options_id                      = (known after apply)
[vpc] :       + enable_dns_hostnames                 = true
[vpc] :       + enable_dns_support                   = true
[vpc] :       + enable_network_address_usage_metrics = (known after apply)
[vpc] :       + id                                   = (known after apply)
[vpc] :       + instance_tenancy                     = "default"
[vpc] :       + ipv6_association_id                  = (known after apply)
[vpc] :       + ipv6_cidr_block                      = (known after apply)
[vpc] :       + ipv6_cidr_block_network_border_group = (known after apply)
[vpc] :       + main_route_table_id                  = (known after apply)
[vpc] :       + owner_id                             = (known after apply)
[vpc] :       + tags                                 = {
[vpc] :           + "application_name" = "bar"
[vpc] :           + "contact_email"    = "bar-team@example.com"
[vpc] :           + "environment"      = "development"
[vpc] :           + "managed_by"       = "terraform"
[vpc] :           + "name"             = "vpc-bar-app-dev"
[vpc] :           + "team_owner"       = "bar-team"
[vpc] :         }
[vpc] :       + tags_all                             = {
[vpc] :           + "application_name" = "bar"
[vpc] :           + "contact_email"    = "bar-team@example.com"
[vpc] :           + "environment"      = "development"
[vpc] :           + "managed_by"       = "terraform"
[vpc] :           + "name"             = "vpc-bar-app-dev"
[vpc] :           + "team_owner"       = "bar-team"
[vpc] :         }
[vpc] :     }
[vpc] : Plan: 17 to add, 0 to change, 0 to destroy.
[vpc] : Changes to Outputs:
[vpc] :   + cloudwatch_log_group_name = (known after apply)
[vpc] :   + flow_log_id               = (known after apply)
[vpc] :   + internet_gateway_id       = (known after apply)
[vpc] :   + nat_gateway_id            = (known after apply)
[vpc] :   + private_subnets           = {
[vpc] :       + private-subnet-1 = {
[vpc] :           + arn                                            = (known after apply)
[vpc] :           + assign_ipv6_address_on_creation                = false
[vpc] :           + availability_zone                              = "us-west-1a"
[vpc] :           + availability_zone_id                           = (known after apply)
[vpc] :           + cidr_block                                     = "192.169.2.0/24"
[vpc] :           + customer_owned_ipv4_pool                       = null
[vpc] :           + enable_dns64                                   = false
[vpc] :           + enable_lni_at_device_index                     = null
[vpc] :           + enable_resource_name_dns_a_record_on_launch    = false
[vpc] :           + enable_resource_name_dns_aaaa_record_on_launch = false
[vpc] :           + id                                             = (known after apply)
[vpc] :           + ipv6_cidr_block                                = null
[vpc] :           + ipv6_cidr_block_association_id                 = (known after apply)
[vpc] :           + ipv6_native                                    = false
[vpc] :           + map_customer_owned_ip_on_launch                = null
[vpc] :           + map_public_ip_on_launch                        = false
[vpc] :           + outpost_arn                                    = null
[vpc] :           + owner_id                                       = (known after apply)
[vpc] :           + private_dns_hostname_type_on_launch            = (known after apply)
[vpc] :           + tags                                           = {
[vpc] :               + application_name = "bar"
[vpc] :               + contact_email    = "bar-team@example.com"
[vpc] :               + environment      = "development"
[vpc] :               + managed_by       = "terraform"
[vpc] :               + name             = "private-subnet-bar-app-dev-1a"
[vpc] :               + team_owner       = "bar-team"
[vpc] :             }
[vpc] :           + tags_all                                       = {
[vpc] :               + application_name = "bar"
[vpc] :               + contact_email    = "bar-team@example.com"
[vpc] :               + environment      = "development"
[vpc] :               + managed_by       = "terraform"
[vpc] :               + name             = "private-subnet-bar-app-dev-1a"
[vpc] :               + team_owner       = "bar-team"
[vpc] :             }
[vpc] :           + timeouts                                       = null
[vpc] :           + vpc_id                                         = (known after apply)
[vpc] :         }
[vpc] :       + private-subnet-2 = {
[vpc] :           + arn                                            = (known after apply)
[vpc] :           + assign_ipv6_address_on_creation                = false
[vpc] :           + availability_zone                              = "us-west-1b"
[vpc] :           + availability_zone_id                           = (known after apply)
[vpc] :           + cidr_block                                     = "192.169.3.0/24"
[vpc] :           + customer_owned_ipv4_pool                       = null
[vpc] :           + enable_dns64                                   = false
[vpc] :           + enable_lni_at_device_index                     = null
[vpc] :           + enable_resource_name_dns_a_record_on_launch    = false
[vpc] :           + enable_resource_name_dns_aaaa_record_on_launch = false
[vpc] :           + id                                             = (known after apply)
[vpc] :           + ipv6_cidr_block                                = null
[vpc] :           + ipv6_cidr_block_association_id                 = (known after apply)
[vpc] :           + ipv6_native                                    = false
[vpc] :           + map_customer_owned_ip_on_launch                = null
[vpc] :           + map_public_ip_on_launch                        = false
[vpc] :           + outpost_arn                                    = null
[vpc] :           + owner_id                                       = (known after apply)
[vpc] :           + private_dns_hostname_type_on_launch            = (known after apply)
[vpc] :           + tags                                           = {
[vpc] :               + application_name = "bar"
[vpc] :               + contact_email    = "bar-team@example.com"
[vpc] :               + environment      = "development"
[vpc] :               + managed_by       = "terraform"
[vpc] :               + name             = "private-subnet-bar-app-dev-1c"
[vpc] :               + team_owner       = "bar-team"
[vpc] :             }
[vpc] :           + tags_all                                       = {
[vpc] :               + application_name = "bar"
[vpc] :               + contact_email    = "bar-team@example.com"
[vpc] :               + environment      = "development"
[vpc] :               + managed_by       = "terraform"
[vpc] :               + name             = "private-subnet-bar-app-dev-1c"
[vpc] :               + team_owner       = "bar-team"
[vpc] :             }
[vpc] :           + timeouts                                       = null
[vpc] :           + vpc_id                                         = (known after apply)
[vpc] :         }
[vpc] :     }
[vpc] :   + public_subnets            = {
[vpc] :       + public-subnet-1 = {
[vpc] :           + arn                                            = (known after apply)
[vpc] :           + assign_ipv6_address_on_creation                = false
[vpc] :           + availability_zone                              = "us-west-1a"
[vpc] :           + availability_zone_id                           = (known after apply)
[vpc] :           + cidr_block                                     = "192.169.1.0/24"
[vpc] :           + customer_owned_ipv4_pool                       = null
[vpc] :           + enable_dns64                                   = false
[vpc] :           + enable_lni_at_device_index                     = null
[vpc] :           + enable_resource_name_dns_a_record_on_launch    = false
[vpc] :           + enable_resource_name_dns_aaaa_record_on_launch = false
[vpc] :           + id                                             = (known after apply)
[vpc] :           + ipv6_cidr_block                                = null
[vpc] :           + ipv6_cidr_block_association_id                 = (known after apply)
[vpc] :           + ipv6_native                                    = false
[vpc] :           + map_customer_owned_ip_on_launch                = null
[vpc] :           + map_public_ip_on_launch                        = true
[vpc] :           + outpost_arn                                    = null
[vpc] :           + owner_id                                       = (known after apply)
[vpc] :           + private_dns_hostname_type_on_launch            = (known after apply)
[vpc] :           + tags                                           = {
[vpc] :               + application_name = "bar"
[vpc] :               + contact_email    = "bar-team@example.com"
[vpc] :               + environment      = "development"
[vpc] :               + managed_by       = "terraform"
[vpc] :               + name             = "public-subnet-bar-app-dev-1a"
[vpc] :               + team_owner       = "bar-team"
[vpc] :             }
[vpc] :           + tags_all                                       = {
[vpc] :               + application_name = "bar"
[vpc] :               + contact_email    = "bar-team@example.com"
[vpc] :               + environment      = "development"
[vpc] :               + managed_by       = "terraform"
[vpc] :               + name             = "public-subnet-bar-app-dev-1a"
[vpc] :               + team_owner       = "bar-team"
[vpc] :             }
[vpc] :           + timeouts                                       = null
[vpc] :           + vpc_id                                         = (known after apply)
[vpc] :         }
[vpc] :     }
[vpc] :   + vpc_id                    = (known after apply)
[vpc] : aws_iam_policy.this[0]: Creating...
[vpc] : aws_iam_role.this[0]: Creating...
[vpc] : aws_vpc.this: Creating...
[vpc] : aws_eip.this: Creating...
[vpc] : aws_iam_role.this[0]: Creation complete after 1s [id=flow-log-role-bar-app-dev]
[vpc] : aws_iam_policy.this[0]: Creation complete after 1s [id=arn:aws:iam::000000000000:policy/flow-log-policy-bar-app-dev]
[vpc] : aws_iam_role_policy_attachment.this[0]: Creating...
[vpc] : aws_iam_role_policy_attachment.this[0]: Creation complete after 0s [id=flow-log-role-bar-app-dev-20250719141341917300000001]
[vpc] : aws_eip.this: Creation complete after 2s [id=eipalloc-16a314af55b77d474]
[vpc] : aws_vpc.this: Still creating... [10s elapsed]
[vpc] : aws_vpc.this: Creation complete after 12s [id=vpc-bf67d95c7bd9607ac]
[vpc] : aws_internet_gateway.this: Creating...
[vpc] : aws_cloudwatch_log_group.this[0]: Creating...
[vpc] : aws_subnet.public["public-subnet-1"]: Creating...
[vpc] : aws_subnet.private["private-subnet-1"]: Creating...
[vpc] : aws_subnet.private["private-subnet-2"]: Creating...
[vpc] : aws_subnet.private["private-subnet-2"]: Creation complete after 0s [id=subnet-0ed7bd61eef982e94]
[vpc] : aws_subnet.private["private-subnet-1"]: Creation complete after 0s [id=subnet-c598dbdf9473a19f4]
[vpc] : aws_internet_gateway.this: Creation complete after 0s [id=igw-14ba5c973711f9a63]
[vpc] : aws_route_table.public: Creating...
[vpc] : aws_route_table.public: Creation complete after 0s [id=rtb-83cbe0f1f6905bbe2]
[vpc] : aws_cloudwatch_log_group.this[0]: Creation complete after 0s [id=/aws/vpc/flow-logs/vpc-bf67d95c7bd9607ac]
[vpc] : aws_flow_log.this[0]: Creating...
[vpc] : aws_flow_log.this[0]: Creation complete after 0s [id=fl-95da67e6136c90923]
[vpc] : aws_subnet.public["public-subnet-1"]: Still creating... [10s elapsed]
[vpc] : aws_subnet.public["public-subnet-1"]: Creation complete after 10s [id=subnet-35e2642ba349eafce]
[vpc] : aws_route_table_association.public["public-subnet-1"]: Creating...
[vpc] : aws_nat_gateway.this: Creating...
[vpc] : aws_route_table_association.public["public-subnet-1"]: Creation complete after 0s [id=rtbassoc-b762310febdc41b8d]
[vpc] : aws_nat_gateway.this: Creation complete after 0s [id=nat-9d206d5fdf37b10ce]
[vpc] : aws_route_table.private: Creating...
[vpc] : aws_route_table.private: Creation complete after 0s [id=rtb-8a0b27843c0f7956d]
[vpc] : aws_route_table_association.private["private-subnet-1"]: Creating...
[vpc] : aws_route_table_association.private["private-subnet-2"]: Creating...
[vpc] : aws_route_table_association.private["private-subnet-2"]: Creation complete after 0s [id=rtbassoc-1281beea8f5203e7e]
[vpc] : aws_route_table_association.private["private-subnet-1"]: Creation complete after 0s [id=rtbassoc-4ad1900412b483e00]
[vpc] : Apply complete! Resources: 17 added, 0 changed, 0 destroyed.
[vpc] : Outputs:
[vpc] : cloudwatch_log_group_name = "/aws/vpc/flow-logs/vpc-bf67d95c7bd9607ac"
[vpc] : flow_log_id = "fl-95da67e6136c90923"
[vpc] : internet_gateway_id = "igw-14ba5c973711f9a63"
[vpc] : nat_gateway_id = "nat-9d206d5fdf37b10ce"
[vpc] : private_subnets = {
[vpc] :   "private-subnet-1" = {
[vpc] :     "arn" = "arn:aws:ec2:us-west-1:000000000000:subnet/subnet-c598dbdf9473a19f4"
[vpc] :     "assign_ipv6_address_on_creation" = false
[vpc] :     "availability_zone" = "us-west-1a"
[vpc] :     "availability_zone_id" = "usw1-az3"
[vpc] :     "cidr_block" = "192.169.2.0/24"
[vpc] :     "customer_owned_ipv4_pool" = ""
[vpc] :     "enable_dns64" = false
[vpc] :     "enable_lni_at_device_index" = 0
[vpc] :     "enable_resource_name_dns_a_record_on_launch" = false
[vpc] :     "enable_resource_name_dns_aaaa_record_on_launch" = false
[vpc] :     "id" = "subnet-c598dbdf9473a19f4"
[vpc] :     "ipv6_cidr_block" = ""
[vpc] :     "ipv6_cidr_block_association_id" = ""
[vpc] :     "ipv6_native" = false
[vpc] :     "map_customer_owned_ip_on_launch" = false
[vpc] :     "map_public_ip_on_launch" = false
[vpc] :     "outpost_arn" = ""
[vpc] :     "owner_id" = "000000000000"
[vpc] :     "private_dns_hostname_type_on_launch" = "ip-name"
[vpc] :     "tags" = tomap({
[vpc] :       "application_name" = "bar"
[vpc] :       "contact_email" = "bar-team@example.com"
[vpc] :       "environment" = "development"
[vpc] :       "managed_by" = "terraform"
[vpc] :       "name" = "private-subnet-bar-app-dev-1a"
[vpc] :       "team_owner" = "bar-team"
[vpc] :     })
[vpc] :     "tags_all" = tomap({
[vpc] :       "application_name" = "bar"
[vpc] :       "contact_email" = "bar-team@example.com"
[vpc] :       "environment" = "development"
[vpc] :       "managed_by" = "terraform"
[vpc] :       "name" = "private-subnet-bar-app-dev-1a"
[vpc] :       "team_owner" = "bar-team"
[vpc] :     })
[vpc] :     "timeouts" = null /* object */
[vpc] :     "vpc_id" = "vpc-bf67d95c7bd9607ac"
[vpc] :   }
[vpc] :   "private-subnet-2" = {
[vpc] :     "arn" = "arn:aws:ec2:us-west-1:000000000000:subnet/subnet-0ed7bd61eef982e94"
[vpc] :     "assign_ipv6_address_on_creation" = false
[vpc] :     "availability_zone" = "us-west-1b"
[vpc] :     "availability_zone_id" = "usw1-az1"
[vpc] :     "cidr_block" = "192.169.3.0/24"
[vpc] :     "customer_owned_ipv4_pool" = ""
[vpc] :     "enable_dns64" = false
[vpc] :     "enable_lni_at_device_index" = 0
[vpc] :     "enable_resource_name_dns_a_record_on_launch" = false
[vpc] :     "enable_resource_name_dns_aaaa_record_on_launch" = false
[vpc] :     "id" = "subnet-0ed7bd61eef982e94"
[vpc] :     "ipv6_cidr_block" = ""
[vpc] :     "ipv6_cidr_block_association_id" = ""
[vpc] :     "ipv6_native" = false
[vpc] :     "map_customer_owned_ip_on_launch" = false
[vpc] :     "map_public_ip_on_launch" = false
[vpc] :     "outpost_arn" = ""
[vpc] :     "owner_id" = "000000000000"
[vpc] :     "private_dns_hostname_type_on_launch" = "ip-name"
[vpc] :     "tags" = tomap({
[vpc] :       "application_name" = "bar"
[vpc] :       "contact_email" = "bar-team@example.com"
[vpc] :       "environment" = "development"
[vpc] :       "managed_by" = "terraform"
[vpc] :       "name" = "private-subnet-bar-app-dev-1c"
[vpc] :       "team_owner" = "bar-team"
[vpc] :     })
[vpc] :     "tags_all" = tomap({
[vpc] :       "application_name" = "bar"
[vpc] :       "contact_email" = "bar-team@example.com"
[vpc] :       "environment" = "development"
[vpc] :       "managed_by" = "terraform"
[vpc] :       "name" = "private-subnet-bar-app-dev-1c"
[vpc] :       "team_owner" = "bar-team"
[vpc] :     })
[vpc] :     "timeouts" = null /* object */
[vpc] :     "vpc_id" = "vpc-bf67d95c7bd9607ac"
[vpc] :   }
[vpc] : }
[vpc] : public_subnets = {
[vpc] :   "public-subnet-1" = {
[vpc] :     "arn" = "arn:aws:ec2:us-west-1:000000000000:subnet/subnet-35e2642ba349eafce"
[vpc] :     "assign_ipv6_address_on_creation" = false
[vpc] :     "availability_zone" = "us-west-1a"
[vpc] :     "availability_zone_id" = "usw1-az3"
[vpc] :     "cidr_block" = "192.169.1.0/24"
[vpc] :     "customer_owned_ipv4_pool" = ""
[vpc] :     "enable_dns64" = false
[vpc] :     "enable_lni_at_device_index" = 0
[vpc] :     "enable_resource_name_dns_a_record_on_launch" = false
[vpc] :     "enable_resource_name_dns_aaaa_record_on_launch" = false
[vpc] :     "id" = "subnet-35e2642ba349eafce"
[vpc] :     "ipv6_cidr_block" = ""
[vpc] :     "ipv6_cidr_block_association_id" = ""
[vpc] :     "ipv6_native" = false
[vpc] :     "map_customer_owned_ip_on_launch" = false
[vpc] :     "map_public_ip_on_launch" = true
[vpc] :     "outpost_arn" = ""
[vpc] :     "owner_id" = "000000000000"
[vpc] :     "private_dns_hostname_type_on_launch" = "ip-name"
[vpc] :     "tags" = tomap({
[vpc] :       "application_name" = "bar"
[vpc] :       "contact_email" = "bar-team@example.com"
[vpc] :       "environment" = "development"
[vpc] :       "managed_by" = "terraform"
[vpc] :       "name" = "public-subnet-bar-app-dev-1a"
[vpc] :       "team_owner" = "bar-team"
[vpc] :     })
[vpc] :     "tags_all" = tomap({
[vpc] :       "application_name" = "bar"
[vpc] :       "contact_email" = "bar-team@example.com"
[vpc] :       "environment" = "development"
[vpc] :       "managed_by" = "terraform"
[vpc] :       "name" = "public-subnet-bar-app-dev-1a"
[vpc] :       "team_owner" = "bar-team"
[vpc] :     })
[vpc] :     "timeouts" = null /* object */
[vpc] :     "vpc_id" = "vpc-bf67d95c7bd9607ac"
[vpc] :   }
[vpc] : }
[vpc] : vpc_id = "vpc-bf67d95c7bd9607ac"
14:14:03.153 INFO   Shutting down Terragrunt Cache server...
14:14:03.153 INFO   Terragrunt Cache server stopped</pre>
</details>